#### [infrastructure/][stage] Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```

terraform
module.ui.azurerm_app_service_plan.appserviceplan[0]: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/serverfarms/time-tracker-ui-stage]
module.ui.azurerm_app_service.app_service: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-ui-stage]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ui.azurerm_app_service.app_service has changed
  ~ resource "azurerm_app_service" "app_service" {
        id                                = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-ui-stage"
        name                              = "time-tracker-ui-stage"
      + tags                              = {}
        # (17 unchanged attributes hidden)


      ~ logs {
            # (2 unchanged attributes hidden)


          ~ http_logs {

              + file_system {
                  + retention_in_days = 0
                  + retention_in_mb   = 35
                }
            }
            # (1 unchanged block hidden)
        }

      ~ site_config {
          + default_documents                    = []
            # (29 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ui.azurerm_app_service_plan.appserviceplan[0] has changed
  ~ resource "azurerm_app_service_plan" "appserviceplan" {
        id                           = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/serverfarms/time-tracker-ui-stage"
        name                         = "time-tracker-ui-stage"
      + tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.ui.azurerm_app_service.app_service will be destroyed
  # (because azurerm_app_service.app_service is not in configuration)
  - resource "azurerm_app_service" "app_service" {
      - app_service_plan_id               = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/serverfarms/time-tracker-ui-stage" -> null
      - app_settings                      = {
          - "DOCKER_REGISTRY_SERVER_PASSWORD" = (sensitive)
          - "DOCKER_REGISTRY_SERVER_URL"      = (sensitive)
          - "DOCKER_REGISTRY_SERVER_USERNAME" = (sensitive)
        } -> null
      - client_affinity_enabled           = false -> null
      - client_cert_enabled               = false -> null
      - client_cert_mode                  = "Required" -> null
      - custom_domain_verification_id     = "6784E371282F6FC9E447605B5866C8A4C84A68F35143F3567B8CAA10F78A43D4" -> null
      - default_site_hostname             = "time-tracker-ui-stage.azurewebsites.net" -> null
      - enabled                           = true -> null
      - https_only                        = false -> null
      - id                                = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/sites/time-tracker-ui-stage" -> null
      - key_vault_reference_identity_id   = "SystemAssigned" -> null
      - location                          = "westus" -> null
      - name                              = "time-tracker-ui-stage" -> null
      - outbound_ip_address_list          = [
          - "40.112.243.46",
          - "40.118.230.174",
          - "104.42.150.243",
          - "40.118.225.132",
          - "40.112.135.83",
        ] -> null
      - outbound_ip_addresses             = "40.112.243.46,40.118.230.174,104.42.150.243,40.118.225.132,40.112.135.83" -> null
      - possible_outbound_ip_address_list = [
          - "40.112.243.46",
          - "40.118.230.174",
          - "104.42.150.243",
          - "40.118.225.132",
          - "40.112.135.83",
          - "40.118.227.215",
          - "40.118.231.14",
          - "13.64.101.180",
          - "104.42.56.180",
          - "40.118.225.130",
        ] -> null
      - possible_outbound_ip_addresses    = "40.112.243.46,40.118.230.174,104.42.150.243,40.118.225.132,40.112.135.83,40.118.227.215,40.118.231.14,13.64.101.180,104.42.56.180,40.118.225.130" -> null
      - resource_group_name               = "time-tracker-service-stage" -> null
      - site_credential                   = [
          - {
              - password = "KjAbTDKZoqe8hdsoJZ6MveympaBM4MWam0WCvxtP8SKCmnnGFLizY5dTpgY2"
              - username = "$time-tracker-ui-stage"
            },
        ] -> null
      - tags                              = {} -> null

      - auth_settings {
          - additional_login_params        = {} -> null
          - allowed_external_redirect_urls = [] -> null
          - enabled                        = false -> null
          - token_refresh_extension_hours  = 0 -> null
          - token_store_enabled            = false -> null
        }

      - logs {
          - detailed_error_messages_enabled = false -> null
          - failed_request_tracing_enabled  = false -> null

          - application_logs {
              - file_system_level = "Off" -> null
            }

          - http_logs {

              - file_system {
                  - retention_in_days = 0 -> null
                  - retention_in_mb   = 35 -> null
                }
            }
        }

      - site_config {
          - acr_use_managed_identity_credentials = false -> null
          - acr_user_managed_identity_client_id  = "" -> null
          - always_on                            = false -> null
          - app_command_line                     = "" -> null
          - auto_swap_slot_name                  = "" -> null
          - default_documents                    = [] -> null
          - dotnet_framework_version             = "v4.0" -> null
          - ftps_state                           = "AllAllowed" -> null
          - health_check_path                    = "" -> null
          - http2_enabled                        = false -> null
          - ip_restriction                       = [] -> null
          - java_container                       = "" -> null
          - java_container_version               = "" -> null
          - java_version                         = "" -> null
          - linux_fx_version                     = (sensitive) -> null
          - local_mysql_enabled                  = false -> null
          - managed_pipeline_mode                = "Integrated" -> null
          - min_tls_version                      = "1.2" -> null
          - number_of_workers                    = 1 -> null
          - php_version                          = "" -> null
          - python_version                       = "" -> null
          - remote_debugging_enabled             = false -> null
          - remote_debugging_version             = "VS2019" -> null
          - scm_ip_restriction                   = [] -> null
          - scm_type                             = "None" -> null
          - scm_use_main_ip_restriction          = false -> null
          - use_32_bit_worker_process            = false -> null
          - vnet_route_all_enabled               = false -> null
          - websockets_enabled                   = false -> null
          - windows_fx_version                   = "" -> null

          - cors {
              - allowed_origins     = [] -> null
              - support_credentials = false -> null
            }
        }

      - source_control {
          - branch             = "master" -> null
          - manual_integration = false -> null
          - rollback_enabled   = false -> null
          - use_mercurial      = false -> null
        }
    }

  # module.ui.azurerm_app_service.this will be created
  + resource "azurerm_app_service" "this" {
      + app_service_plan_id               = (known after apply)
      + app_settings                      = {
          + "DOCKER_REGISTRY_SERVER_PASSWORD" = (sensitive)
          + "DOCKER_REGISTRY_SERVER_URL"      = (sensitive)
          + "DOCKER_REGISTRY_SERVER_USERNAME" = (sensitive)
        }
      + client_affinity_enabled           = false
      + client_cert_enabled               = false
      + client_cert_mode                  = (known after apply)
      + custom_domain_verification_id     = (known after apply)
      + default_site_hostname             = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + location                          = "westus"
      + name                              = "time-tracker-ui-stage"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "time-tracker-service-stage"
      + site_credential                   = (known after apply)

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + logs {
          + detailed_error_messages_enabled = (known after apply)
          + failed_request_tracing_enabled  = (known after apply)

          + application_logs {
              + file_system_level = (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + acr_use_managed_identity_credentials = false
          + always_on                            = false
          + dotnet_framework_version             = "v4.0"
          + ftps_state                           = (known after apply)
          + http2_enabled                        = false
          + ip_restriction                       = (known after apply)
          + linux_fx_version                     = (sensitive)
          + local_mysql_enabled                  = (known after apply)
          + managed_pipeline_mode                = (known after apply)
          + min_tls_version                      = (known after apply)
          + number_of_workers                    = (known after apply)
          + remote_debugging_enabled             = false
          + remote_debugging_version             = (known after apply)
          + scm_ip_restriction                   = (known after apply)
          + scm_type                             = (known after apply)
          + scm_use_main_ip_restriction          = false
          + vnet_route_all_enabled               = (known after apply)
          + websockets_enabled                   = (known after apply)
          + windows_fx_version                   = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = (known after apply)
          + manual_integration = (known after apply)
          + repo_url           = (known after apply)
          + rollback_enabled   = (known after apply)
          + use_mercurial      = (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.ui.azurerm_app_service_certificate_binding.this will be created
  + resource "azurerm_app_service_certificate_binding" "this" {
      + app_service_name    = (known after apply)
      + certificate_id      = (known after apply)
      + hostname            = (known after apply)
      + hostname_binding_id = (known after apply)
      + id                  = (known after apply)
      + ssl_state           = "SniEnabled"
      + thumbprint          = (known after apply)
    }

  # module.ui.azurerm_app_service_custom_hostname_binding.this will be created
  + resource "azurerm_app_service_custom_hostname_binding" "this" {
      + app_service_name    = "time-tracker-ui-stage"
      + hostname            = "ui.timetrackerapp.stage.ioet.com"
      + id                  = (known after apply)
      + resource_group_name = "time-tracker-service-stage"
      + ssl_state           = (known after apply)
      + thumbprint          = (known after apply)
      + virtual_ip          = (known after apply)
    }

  # module.ui.azurerm_app_service_managed_certificate.this will be created
  + resource "azurerm_app_service_managed_certificate" "this" {
      + canonical_name             = (known after apply)
      + custom_hostname_binding_id = (known after apply)
      + expiration_date            = (known after apply)
      + friendly_name              = (known after apply)
      + host_names                 = (known after apply)
      + id                         = (known after apply)
      + issue_date                 = (known after apply)
      + issuer                     = (known after apply)
      + subject_name               = (known after apply)
      + thumbprint                 = (known after apply)
    }

  # module.ui.azurerm_app_service_plan.appserviceplan[0] will be destroyed
  # (because azurerm_app_service_plan.appserviceplan is not in configuration)
  - resource "azurerm_app_service_plan" "appserviceplan" {
      - id                           = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-stage/providers/Microsoft.Web/serverfarms/time-tracker-ui-stage" -> null
      - is_xenon                     = false -> null
      - kind                         = "linux" -> null
      - location                     = "westus" -> null
      - maximum_elastic_worker_count = 1 -> null
      - maximum_number_of_workers    = 10 -> null
      - name                         = "time-tracker-ui-stage" -> null
      - per_site_scaling             = false -> null
      - reserved                     = true -> null
      - resource_group_name          = "time-tracker-service-stage" -> null
      - tags                         = {} -> null
      - zone_redundant               = false -> null

      - sku {
          - capacity = 1 -> null
          - size     = "S1" -> null
          - tier     = "Standard" -> null
        }
    }

  # module.ui.azurerm_app_service_plan.plan[0] will be created
  + resource "azurerm_app_service_plan" "plan" {
      + id                           = (known after apply)
      + kind                         = "Linux"
      + location                     = "westus"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "time-tracker-ui-stage"
      + reserved                     = true
      + resource_group_name          = "time-tracker-service-stage"

      + sku {
          + capacity = (known after apply)
          + size     = "S1"
          + tier     = "Standard"
        }
    }

  # module.ui.azurerm_dns_cname_record.this will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ui"
      + record              = (known after apply)
      + resource_group_name = "time-tracker-service-stage"
      + ttl                 = 300
      + zone_name           = "timetrackerapp.stage.ioet.com"
    }

  # module.ui.azurerm_dns_txt_record.this will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "asuid.ui.timetrackerapp.stage.ioet.com"
      + resource_group_name = "time-tracker-service-stage"
      + ttl                 = 300
      + zone_name           = "timetrackerapp.stage.ioet.com"

      + record {
          + value = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @faustocv, Action: `pull_request`*